Revit 2024 API
OptionalFunctionalityUtils.IsDWGExportAvailable Method
 Checks whether the DWG Export functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static bool IsDWGExportAvailable()
Visual Basic
Public Shared Function IsDWGExportAvailable As Boolean
Visual C++
public:
static bool IsDWGExportAvailable()
Return Value
 True if the DWG Export functionality is available in the installed Revit.
Remarks
 DWG Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace